Revit 2026 API

# AppearanceAssetEditScope Constructor

---

Constructs a new instance of an AppearanceAssetEditScope.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AppearanceAssetEditScope(
	Document document
)
```
```vb
Public Sub New (
	document As Document
)
```
```cpp
public:
AppearanceAssetEditScope(
	Document^ document
)
```
```fsharp
new :
        document : Document -> AppearanceAssetEditScope
```

#### Parameters

document Document
     The document for which this EditScope is going to be used.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AppearanceAssetEditScope Class

Autodesk.Revit.DB.Visual Namespace